app/controllers/armazenamentos_controller.rb

SELECT "armazenamentos".* FROM "armazenamentos"
---
  def index
    @armazenamentos = Armazenamento.all

INSERT INTO "armazenamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "deposito"], ["created_at", "2021-07-13 00:31:46.577403"], ["updated_at", "2021-07-13 00:31:46.577403"]]
---
  def create
    @armazenamento = Armazenamento.new(armazenamento_params)

    respond_to do |format|
      if @armazenamento.save

DELETE FROM "armazenamentos" WHERE "armazenamentos"."id" = ?  [["id", 1]]
---
  def destroy
    @armazenamento.destroy

SELECT "armazenamentos".* FROM "armazenamentos" WHERE "armazenamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_armazenamento
      @armazenamento = Armazenamento.find(params[:id])