app/controllers/csv_controller.rb

SELECT "movimentacaos".* FROM "movimentacaos"
---
  def exportaMovimentacao
    @movimentacoes = Movimentacao.all
    if @movimentacoes.present?