app/controllers/movimentacaos_controller.rb

    def set_movimentacao
      @movimentacao = Movimentacao.find(params[:id])
---
SELECT "movimentacaos".* FROM "movimentacaos" WHERE "movimentacaos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]