app/controllers/movimentacaos_controller.rb

  def index
    @movimentacaos = Movimentacao.all
---
SELECT "movimentacaos".* FROM "movimentacaos"

  def create_by_csv
    @estoques = CSV.parse(params[:csv].read,{col_sep:';',headers:true}) rescue nil
    @produtos = Produto.all
    @depositos = Armazenamento.all
    if @estoques.present?
      @estoques.each do |estoque|
        @produto = @produtos.where(nome:estoque['Nome do produto'].downcase).first
        @deposito = @depositos.where(nome:estoque['Nome do deposito'].downcase).first
        if @produto.nil?
          @produto = Produto.create({nome:estoque['Nome do produto'].downcase})
          @produto.save
        end
        if @deposito.nil?
          @deposito = Armazenamento.create({nome:estoque['Nome do deposito'].downcase})
          @deposito.save
        end
          @movimentacao = Movimentacao.new({produto_id: @produto.id, armazenamento_id: @deposito.id, tipo: estoque['Tipo de movimentacao'].upcase, quantidade: estoque['Quantidade do produto'].to_i, data_movimentacao: estoque['Data'].to_date})
          @movimentacao.save
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."nome" = ? ORDER BY "produtos"."id" ASC LIMIT ?  [["nome", ""], ["LIMIT", 1]]
SELECT "armazenamentos".* FROM "armazenamentos" WHERE "armazenamentos"."nome" = ? ORDER BY "armazenamentos"."id" ASC LIMIT ?  [["nome", "deposito 1"], ["LIMIT", 1]]
INSERT INTO "produtos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "soja"], ["created_at", "2021-07-13 11:43:08.260678"], ["updated_at", "2021-07-13 11:43:08.260678"]]
INSERT INTO "armazenamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "deposito 1"], ["created_at", "2021-07-14 15:49:36.079513"], ["updated_at", "2021-07-14 15:49:36.079513"]]
INSERT INTO "produtos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "soja"], ["created_at", "2021-07-12 22:16:26.288257"], ["updated_at", "2021-07-12 22:16:26.288257"]]
INSERT INTO "armazenamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "1"], ["created_at", "2021-07-13 11:43:08.269184"], ["updated_at", "2021-07-13 11:43:08.269184"]]
INSERT INTO "movimentacaos" ("produto_id", "armazenamento_id", "tipo", "quantidade", "data_movimentacao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def create
    @movimentacao = Movimentacao.new(movimentacao_params)
    @movimentacao.tipo = params[:tipo].upcase
    @armazenamento = Armazenamento.where(nome: movimentacao_params[:armazenamento_id].downcase).first
    @movimentacao.data_movimentacao = params[:data].to_date + 3.hours
    @produto = Produto.where(nome: movimentacao_params[:produto_id].downcase).first
    if @produto.present?
      @movimentacao.produto_id = @produto.id
    else
      @produto = Produto.create({nome:movimentacao_params[:produto_id].downcase})
      @produto.save
      @movimentacao.produto_id = @produto.id
    end
    if @armazenamento.present?

      @movimentacao.armazenamento_id = @armazenamento.id
    else
      @armazenamento = Armazenamento.create({nome:movimentacao_params[:armazenamento_id].downcase})
      @armazenamento.save
      @movimentacao.armazenamento_id = @armazenamento.id
    end

    respond_to do |format|
      if @movimentacao.save
---
SELECT "armazenamentos".* FROM "armazenamentos" WHERE "armazenamentos"."nome" = ? ORDER BY "armazenamentos"."id" ASC LIMIT ?  [["nome", "deposito"], ["LIMIT", 1]]
SELECT "produtos".* FROM "produtos" WHERE "produtos"."nome" = ? ORDER BY "produtos"."id" ASC LIMIT ?  [["nome", "milho"], ["LIMIT", 1]]
SELECT "produtos".* FROM "produtos" WHERE "produtos"."nome" = ? ORDER BY "produtos"."id" ASC LIMIT ?  [["nome", "trigo"], ["LIMIT", 1]]
INSERT INTO "movimentacaos" ("produto_id", "localArmazenamento_id", "tipo", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["produto_id", 3], ["localArmazenamento_id", 2], ["tipo", "E"], ["quantidade", 23], ["created_at", "2021-07-12 22:52:21.039280"], ["updated_at", "2021-07-12 22:52:21.039280"]]
INSERT INTO "produtos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "trigo"], ["created_at", "2021-07-13 17:50:06.119197"], ["updated_at", "2021-07-13 17:50:06.119197"]]
UPDATE "movimentacaos" SET "quantidade" = ?, "updated_at" = ? WHERE "movimentacaos"."id" = ?  [["quantidade", 75002], ["updated_at", "2021-07-13 15:22:27.490266"], ["id", 1]]
SELECT "armazenamentos".* FROM "armazenamentos" WHERE "armazenamentos"."nome" = ? ORDER BY "armazenamentos"."id" ASC LIMIT ?  [["nome", "1"], ["LIMIT", 1]]
INSERT INTO "armazenamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "deposito"], ["created_at", "2021-07-14 15:56:51.801216"], ["updated_at", "2021-07-14 15:56:51.801216"]]
INSERT INTO "produtos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "milho"], ["created_at", "2021-07-13 17:30:20.018228"], ["updated_at", "2021-07-13 17:30:20.018228"]]
INSERT INTO "armazenamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "deposito 4\t"], ["created_at", "2021-07-14 00:00:26.039255"], ["updated_at", "2021-07-14 00:00:26.039255"]]
INSERT INTO "movimentacaos" ("produto_id", "armazenamento_id", "tipo", "quantidade", "data_movimentacao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def total_armazenado
  @movimentacoes = Movimentacao.joins(:produto).joins(:armazenamento).select('armazenamentos.nome,produtos.nome').group('armazenamentos.nome').group('produtos.nome').order('sum(movimentacaos.quantidade) desc').sum(:quantidade).to_a
---
SELECT SUM("movimentacaos"."quantidade") AS sum_quantidade, "armazenamentos"."nome" AS armazenamentos_nome, "produtos"."nome" AS produtos_nome FROM "movimentacaos" INNER JOIN "produtos" ON "produtos"."id" = "movimentacaos"."produto_id" INNER JOIN "armazenamentos" ON "armazenamentos"."id" = "movimentacaos"."armazenamento_id" GROUP BY "armazenamentos"."nome", "produtos"."nome" ORDER BY sum(movimentacaos.quantidade) desc

  def update
    respond_to do |format|
      @movimentacao.data_movimentacao = params[:data].to_date + 3.hours if params[:data].present?
      @movimentacao.tipo = params[:tipo].upcase
      if @movimentacao.update(movimentacao_params)
---
SELECT "movimentacaos".* FROM "movimentacaos"
UPDATE "movimentacaos" SET "tipo" = ?, "quantidade" = ?, "updated_at" = ? WHERE "movimentacaos"."id" = ?  [["tipo", "S"], ["quantidade", -2000], ["updated_at", "2021-07-13 18:00:06.171767"], ["id", 5]]

  def destroy
    @movimentacao.destroy
---
DELETE FROM "movimentacaos" WHERE "movimentacaos"."id" = ?  [["id", 1]]

    def set_movimentacao
      @movimentacao = Movimentacao.find(params[:id])
---
SELECT "movimentacaos".* FROM "movimentacaos" WHERE "movimentacaos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]