app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all
---
SELECT "produtos".* FROM "produtos"

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Soja"], ["created_at", "2021-07-12 20:45:32.449394"], ["updated_at", "2021-07-12 20:45:32.449394"]]

  def destroy
    @produto.destroy
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 1]]