app/models/movimentacao.rb

  def verifica_estoque
    if self.tipo == "S"
      estoque_total = Movimentacao.where("produto_id = ? AND armazenamento_id = ? AND tipo = 'E'",self.produto_id,self.armazenamento_id).sum(:quantidade)
---
SELECT SUM("movimentacaos"."quantidade") FROM "movimentacaos" WHERE (produto_id = 1 AND armazenamento_id = 1 AND tipo = 'E')